{"config": [{"config": {"cropping": [[45, 25], [0, 0]], "trainable": true, "name": "cropping2d_4", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-c9d594f81797>\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "name": "lambda_7", "function_type": "lambda", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002\u00da\nimage_data\u00da\u0002tf\u00a9\u0000r\t\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-c9d594f81797>\u00da\u0006resize\u0011\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "trainable": true, "arguments": {}, "name": "lambda_8", "function_type": "lambda", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"bias": true, "nb_row": 1, "trainable": true, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_19", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "dim_ordering": "tf", "nb_filter": 3, "W_constraint": null, "nb_col": 1, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"bias": true, "nb_row": 5, "trainable": true, "activity_regularizer": null, "activation": "elu", "subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_20", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "dim_ordering": "tf", "nb_filter": 24, "W_constraint": null, "nb_col": 5, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"bias": true, "nb_row": 5, "trainable": true, "activity_regularizer": null, "activation": "elu", "subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_21", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "dim_ordering": "tf", "nb_filter": 36, "W_constraint": null, "nb_col": 5, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"bias": true, "nb_row": 5, "trainable": true, "activity_regularizer": null, "activation": "elu", "subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_22", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "dim_ordering": "tf", "nb_filter": 48, "W_constraint": null, "nb_col": 5, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"bias": true, "nb_row": 3, "trainable": true, "activity_regularizer": null, "activation": "elu", "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_23", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "nb_col": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"bias": true, "nb_row": 3, "trainable": true, "activity_regularizer": null, "activation": "elu", "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_24", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "nb_col": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_4"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "class_name": "Dropout"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 1152, "output_dim": 100, "init": "he_normal", "name": "dense_13", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 100, "output_dim": 50, "init": "he_normal", "name": "dense_14", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 50, "output_dim": 10, "init": "he_normal", "name": "dense_15", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 10, "output_dim": 1, "init": "glorot_uniform", "name": "dense_16", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}